; domain
;Header and description

(define (domain clean-robot)

;import needed requirements
(:requirements :strips :negative-preconditions :typing)

;define types box and robot just for simplicity
(:types box - movable robot - movable office)

; There is always only one robot so it can be 
; defined as a constant
(:constants R - robot)

(:predicates
 (at ?B - movable ?o - office) ; The object B is at office o
 (adj ?o1 ?o2 - office) ; The offices o1 and o2 are adjacent
 (dirty ?o - office) ; The office o is dirty
 (empty ?o - office) ; There is no box at office o
)

(:action clean
    :parameters (?o - office)
    :precondition (and (at R ?o) ; The robot is at office o
                       (dirty ?o) ; The office o is dirty
                    )
    :effect (and (not (dirty ?o)) ; The office o is not dirty anymore
            )
)

(:action move
    :parameters (?o1 ?o2 - office)
    :precondition (and (adj ?o1 ?o2) ; Both offices are adjacent
                        (at R ?o1) ; The robot is at office o1
                   )
    :effect (and (not (at R ?o1)) ; The robot is not at office o1 anymore
                 (at R ?o2) ; The robot is now at office o2
            )
)

(:action push
    :parameters (?B - box ?o1 ?o2 - office)
    :precondition (and (at R ?o1) ; The robot is at office o1
                       (adj ?o1 ?o2) ; Both offices are adjacent
                       (at ?B ?o1) (empty ?o2) ; The box B is at o1 and o2 is empty
                   )
    :effect (and (at R ?o2) (not (at R ?o1)) ; Move the robot to o2
                 (at ?B ?o2) (not (at ?B ?o1)) ; Move the box to o2
                 (not (empty ?o2)) (empty ?o1) ; o2 is not empty anymore and o1 is empty
            )
)



;define actions here

)

; problem
(define (problem NBOX8) (:domain clean-robot)
(:objects
    o1 o2 o3 o4 o5 o6 o7 o8 o9 - office ; Offices
    A B C D E F G H - box    ; Boxes
)

(:init

 ; Adjacency conditions
 (adj o1 o2) (adj o2 o1)
 (adj o1 o4) (adj o4 o1)

 (adj o2 o5) (adj o5 o2)
 (adj o2 o3) (adj o3 o2)

 (adj o3 o6) (adj o6 o3)
 (adj o4 o5) (adj o5 o4)

 (adj o4 o7) (adj o7 o4)
 (adj o5 o6) (adj o6 o5)

 (adj o5 o8) (adj o8 o5)
 (adj o6 o9) (adj o9 o6)

 (adj o7 o8) (adj o8 o7)
 (adj o8 o9) (adj o9 o8)
 
 ; Robot initial location
 (at R o7)

 ; Box initial locations map
 (at A o1) (at H o2) (at E o3) 
 (at F o4) (at G o5) (at B o6) 
 (at D o7) (empty o8) (at C o9)

 ; Dirty offices
 (dirty o3)
 (dirty o4)

)

(:goal (and
    ; Robot final location
    (at R o4)

    ; Clean offices
    (not (dirty o3))
    (not (dirty o4))

    ; Boxes final locations
    (at A o2) (at B o3) (at C o8) (at D o9) 
    (at E o5) (at F o7) (at G o6) (at H o1)

))
)

; plan
1. (move o7 o4)
   deleted: (at r o7)
   added: (at r o4)
   goals met: 1 of 11
2. (clean o4)
   deleted: (dirty o4)
   goals met: 2 of 11
3. (move o4 o7)
   deleted: (at r o4)
   added: (at r o7)
   goals met: 1 of 11
4. (push d o7 o8)
   deleted: (at r o7) (at d o7) (empty o8)
   added: (at r o8) (at d o8) (empty o7)
   goals met: 1 of 11
5. (move o8 o5)
   deleted: (at r o8)
   added: (at r o5)
   goals met: 1 of 11
6. (move o5 o4)
   deleted: (at r o5)
   added: (at r o4)
   goals met: 2 of 11
7. (push f o4 o7)
   deleted: (at r o4) (at f o4) (empty o7)
   added: (at r o7) (at f o7) (empty o4)
   goals met: 2 of 11
8. (move o7 o4)
   deleted: (at r o7)
   added: (at r o4)
   goals met: 3 of 11
9. (move o4 o5)
   deleted: (at r o4)
   added: (at r o5)
   goals met: 2 of 11
10. (push g o5 o4)
   deleted: (at r o5) (at g o5) (empty o4)
   added: (at r o4) (at g o4) (empty o5)
   goals met: 3 of 11
11. (move o4 o5)
   deleted: (at r o4)
   added: (at r o5)
   goals met: 2 of 11
12. (move o5 o2)
   deleted: (at r o5)
   added: (at r o2)
   goals met: 2 of 11
13. (move o2 o3)
   deleted: (at r o2)
   added: (at r o3)
   goals met: 2 of 11
14. (clean o3)
   deleted: (dirty o3)
   goals met: 3 of 11
15. (move o3 o2)
   deleted: (at r o3)
   added: (at r o2)
   goals met: 3 of 11
16. (push h o2 o5)
   deleted: (at r o2) (at h o2) (empty o5)
   added: (at r o5) (at h o5) (empty o2)
   goals met: 3 of 11
17. (move o5 o6)
   deleted: (at r o5)
   added: (at r o6)
   goals met: 3 of 11
18. (move o6 o3)
   deleted: (at r o6)
   added: (at r o3)
   goals met: 3 of 11
19. (push e o3 o2)
   deleted: (at r o3) (at e o3) (empty o2)
   added: (at r o2) (at e o2) (empty o3)
   goals met: 3 of 11
20. (move o2 o5)
   deleted: (at r o2)
   added: (at r o5)
   goals met: 3 of 11
21. (move o5 o6)
   deleted: (at r o5)
   added: (at r o6)
   goals met: 3 of 11
22. (push b o6 o3)
   deleted: (at r o6) (at b o6) (empty o3)
   added: (at r o3) (at b o3) (empty o6)
   goals met: 4 of 11
23. (move o3 o6)
   deleted: (at r o3)
   added: (at r o6)
   goals met: 4 of 11
24. (move o6 o9)
   deleted: (at r o6)
   added: (at r o9)
   goals met: 4 of 11
25. (push c o9 o6)
   deleted: (at r o9) (at c o9) (empty o6)
   added: (at r o6) (at c o6) (empty o9)
   goals met: 4 of 11
26. (move o6 o5)
   deleted: (at r o6)
   added: (at r o5)
   goals met: 4 of 11
27. (move o5 o8)
   deleted: (at r o5)
   added: (at r o8)
   goals met: 4 of 11
28. (push d o8 o9)
   deleted: (at r o8) (at d o8) (empty o9)
   added: (at r o9) (at d o9) (empty o8)
   goals met: 5 of 11
29. (move o9 o8)
   deleted: (at r o9)
   added: (at r o8)
   goals met: 5 of 11
30. (move o8 o7)
   deleted: (at r o8)
   added: (at r o7)
   goals met: 5 of 11
31. (push f o7 o8)
   deleted: (at r o7) (at f o7) (empty o8)
   added: (at r o8) (at f o8) (empty o7)
   goals met: 4 of 11
32. (move o8 o5)
   deleted: (at r o8)
   added: (at r o5)
   goals met: 4 of 11
33. (move o5 o4)
   deleted: (at r o5)
   added: (at r o4)
   goals met: 5 of 11
34. (push g o4 o7)
   deleted: (at r o4) (at g o4) (empty o7)
   added: (at r o7) (at g o7) (empty o4)
   goals met: 4 of 11
35. (move o7 o4)
   deleted: (at r o7)
   added: (at r o4)
   goals met: 5 of 11
36. (move o4 o5)
   deleted: (at r o4)
   added: (at r o5)
   goals met: 4 of 11
37. (push h o5 o4)
   deleted: (at r o5) (at h o5) (empty o4)
   added: (at r o4) (at h o4) (empty o5)
   goals met: 5 of 11
38. (move o4 o5)
   deleted: (at r o4)
   added: (at r o5)
   goals met: 4 of 11
39. (move o5 o2)
   deleted: (at r o5)
   added: (at r o2)
   goals met: 4 of 11
40. (push e o2 o5)
   deleted: (at r o2) (at e o2) (empty o5)
   added: (at r o5) (at e o5) (empty o2)
   goals met: 5 of 11
41. (move o5 o4)
   deleted: (at r o5)
   added: (at r o4)
   goals met: 6 of 11
42. (move o4 o1)
   deleted: (at r o4)
   added: (at r o1)
   goals met: 5 of 11
43. (push a o1 o2)
   deleted: (at r o1) (at a o1) (empty o2)
   added: (at r o2) (at a o2) (empty o1)
   goals met: 6 of 11
44. (move o2 o5)
   deleted: (at r o2)
   added: (at r o5)
   goals met: 6 of 11
45. (move o5 o4)
   deleted: (at r o5)
   added: (at r o4)
   goals met: 7 of 11
46. (push h o4 o1)
   deleted: (at r o4) (at h o4) (empty o1)
   added: (at r o1) (at h o1) (empty o4)
   goals met: 7 of 11
47. (move o1 o4)
   deleted: (at r o1)
   added: (at r o4)
   goals met: 8 of 11
48. (move o4 o5)
   deleted: (at r o4)
   added: (at r o5)
   goals met: 7 of 11
49. (push e o5 o4)
   deleted: (at r o5) (at e o5) (empty o4)
   added: (at r o4) (at e o4) (empty o5)
   goals met: 7 of 11
50. (move o4 o5)
   deleted: (at r o4)
   added: (at r o5)
   goals met: 6 of 11
51. (move o5 o6)
   deleted: (at r o5)
   added: (at r o6)
   goals met: 6 of 11
52. (push c o6 o5)
   deleted: (at r o6) (at c o6) (empty o5)
   added: (at r o5) (at c o5) (empty o6)
   goals met: 6 of 11
53. (move o5 o8)
   deleted: (at r o5)
   added: (at r o8)
   goals met: 6 of 11
54. (move o8 o9)
   deleted: (at r o8)
   added: (at r o9)
   goals met: 6 of 11
55. (push d o9 o6)
   deleted: (at r o9) (at d o9) (empty o6)
   added: (at r o6) (at d o6) (empty o9)
   goals met: 5 of 11
56. (move o6 o5)
   deleted: (at r o6)
   added: (at r o5)
   goals met: 5 of 11
57. (move o5 o8)
   deleted: (at r o5)
   added: (at r o8)
   goals met: 5 of 11
58. (push f o8 o9)
   deleted: (at r o8) (at f o8) (empty o9)
   added: (at r o9) (at f o9) (empty o8)
   goals met: 5 of 11
59. (move o9 o8)
   deleted: (at r o9)
   added: (at r o8)
   goals met: 5 of 11
60. (move o8 o5)
   deleted: (at r o8)
   added: (at r o5)
   goals met: 5 of 11
61. (push c o5 o8)
   deleted: (at r o5) (at c o5) (empty o8)
   added: (at r o8) (at c o8) (empty o5)
   goals met: 6 of 11
62. (move o8 o5)
   deleted: (at r o8)
   added: (at r o5)
   goals met: 6 of 11
63. (move o5 o4)
   deleted: (at r o5)
   added: (at r o4)
   goals met: 7 of 11
64. (push e o4 o5)
   deleted: (at r o4) (at e o4) (empty o5)
   added: (at r o5) (at e o5) (empty o4)
   goals met: 7 of 11
65. (move o5 o4)
   deleted: (at r o5)
   added: (at r o4)
   goals met: 8 of 11
66. (move o4 o7)
   deleted: (at r o4)
   added: (at r o7)
   goals met: 7 of 11
67. (push g o7 o4)
   deleted: (at r o7) (at g o7) (empty o4)
   added: (at r o4) (at g o4) (empty o7)
   goals met: 8 of 11
68. (move o4 o5)
   deleted: (at r o4)
   added: (at r o5)
   goals met: 7 of 11
69. (move o5 o8)
   deleted: (at r o5)
   added: (at r o8)
   goals met: 7 of 11
70. (push c o8 o7)
   deleted: (at r o8) (at c o8) (empty o7)
   added: (at r o7) (at c o7) (empty o8)
   goals met: 6 of 11
71. (move o7 o8)
   deleted: (at r o7)
   added: (at r o8)
   goals met: 6 of 11
72. (move o8 o9)
   deleted: (at r o8)
   added: (at r o9)
   goals met: 6 of 11
73. (push f o9 o8)
   deleted: (at r o9) (at f o9) (empty o8)
   added: (at r o8) (at f o8) (empty o9)
   goals met: 6 of 11
74. (move o8 o5)
   deleted: (at r o8)
   added: (at r o5)
   goals met: 6 of 11
75. (move o5 o6)
   deleted: (at r o5)
   added: (at r o6)
   goals met: 6 of 11
76. (push d o6 o9)
   deleted: (at r o6) (at d o6) (empty o9)
   added: (at r o9) (at d o9) (empty o6)
   goals met: 7 of 11
77. (move o9 o8)
   deleted: (at r o9)
   added: (at r o8)
   goals met: 7 of 11
78. (move o8 o5)
   deleted: (at r o8)
   added: (at r o5)
   goals met: 7 of 11
79. (push e o5 o6)
   deleted: (at r o5) (at e o5) (empty o6)
   added: (at r o6) (at e o6) (empty o5)
   goals met: 6 of 11
80. (move o6 o5)
   deleted: (at r o6)
   added: (at r o5)
   goals met: 6 of 11
81. (move o5 o4)
   deleted: (at r o5)
   added: (at r o4)
   goals met: 7 of 11
82. (push g o4 o5)
   deleted: (at r o4) (at g o4) (empty o5)
   added: (at r o5) (at g o5) (empty o4)
   goals met: 6 of 11
83. (move o5 o8)
   deleted: (at r o5)
   added: (at r o8)
   goals met: 6 of 11
84. (move o8 o7)
   deleted: (at r o8)
   added: (at r o7)
   goals met: 6 of 11
85. (push c o7 o4)
   deleted: (at r o7) (at c o7) (empty o4)
   added: (at r o4) (at c o4) (empty o7)
   goals met: 7 of 11
86. (move o4 o5)
   deleted: (at r o4)
   added: (at r o5)
   goals met: 6 of 11
87. (move o5 o8)
   deleted: (at r o5)
   added: (at r o8)
   goals met: 6 of 11
88. (push f o8 o7)
   deleted: (at r o8) (at f o8) (empty o7)
   added: (at r o7) (at f o7) (empty o8)
   goals met: 7 of 11
89. (move o7 o4)
   deleted: (at r o7)
   added: (at r o4)
   goals met: 8 of 11
90. (move o4 o5)
   deleted: (at r o4)
   added: (at r o5)
   goals met: 7 of 11
91. (push g o5 o8)
   deleted: (at r o5) (at g o5) (empty o8)
   added: (at r o8) (at g o8) (empty o5)
   goals met: 7 of 11
92. (move o8 o5)
   deleted: (at r o8)
   added: (at r o5)
   goals met: 7 of 11
93. (move o5 o4)
   deleted: (at r o5)
   added: (at r o4)
   goals met: 8 of 11
94. (push c o4 o5)
   deleted: (at r o4) (at c o4) (empty o5)
   added: (at r o5) (at c o5) (empty o4)
   goals met: 7 of 11
95. (move o5 o8)
   deleted: (at r o5)
   added: (at r o8)
   goals met: 7 of 11
96. (move o8 o7)
   deleted: (at r o8)
   added: (at r o7)
   goals met: 7 of 11
97. (push f o7 o4)
   deleted: (at r o7) (at f o7) (empty o4)
   added: (at r o4) (at f o4) (empty o7)
   goals met: 7 of 11
98. (move o4 o5)
   deleted: (at r o4)
   added: (at r o5)
   goals met: 6 of 11
99. (move o5 o8)
   deleted: (at r o5)
   added: (at r o8)
   goals met: 6 of 11
100. (push g o8 o7)
   deleted: (at r o8) (at g o8) (empty o7)
   added: (at r o7) (at g o7) (empty o8)
   goals met: 6 of 11
101. (move o7 o4)
   deleted: (at r o7)
   added: (at r o4)
   goals met: 7 of 11
102. (move o4 o5)
   deleted: (at r o4)
   added: (at r o5)
   goals met: 6 of 11
103. (push c o5 o8)
   deleted: (at r o5) (at c o5) (empty o8)
   added: (at r o8) (at c o8) (empty o5)
   goals met: 7 of 11
104. (move o8 o5)
   deleted: (at r o8)
   added: (at r o5)
   goals met: 7 of 11
105. (move o5 o6)
   deleted: (at r o5)
   added: (at r o6)
   goals met: 7 of 11
106. (push e o6 o5)
   deleted: (at r o6) (at e o6) (empty o5)
   added: (at r o5) (at e o5) (empty o6)
   goals met: 8 of 11
107. (move o5 o8)
   deleted: (at r o5)
   added: (at r o8)
   goals met: 8 of 11
108. (move o8 o9)
   deleted: (at r o8)
   added: (at r o9)
   goals met: 8 of 11
109. (push d o9 o6)
   deleted: (at r o9) (at d o9) (empty o6)
   added: (at r o6) (at d o6) (empty o9)
   goals met: 7 of 11
110. (move o6 o5)
   deleted: (at r o6)
   added: (at r o5)
   goals met: 7 of 11
111. (move o5 o8)
   deleted: (at r o5)
   added: (at r o8)
   goals met: 7 of 11
112. (push c o8 o9)
   deleted: (at r o8) (at c o8) (empty o9)
   added: (at r o9) (at c o9) (empty o8)
   goals met: 6 of 11
113. (move o9 o8)
   deleted: (at r o9)
   added: (at r o8)
   goals met: 6 of 11
114. (move o8 o7)
   deleted: (at r o8)
   added: (at r o7)
   goals met: 6 of 11
115. (push g o7 o8)
   deleted: (at r o7) (at g o7) (empty o8)
   added: (at r o8) (at g o8) (empty o7)
   goals met: 6 of 11
116. (move o8 o5)
   deleted: (at r o8)
   added: (at r o5)
   goals met: 6 of 11
117. (move o5 o4)
   deleted: (at r o5)
   added: (at r o4)
   goals met: 7 of 11
118. (push f o4 o7)
   deleted: (at r o4) (at f o4) (empty o7)
   added: (at r o7) (at f o7) (empty o4)
   goals met: 7 of 11
119. (move o7 o4)
   deleted: (at r o7)
   added: (at r o4)
   goals met: 8 of 11
120. (move o4 o5)
   deleted: (at r o4)
   added: (at r o5)
   goals met: 7 of 11
121. (push e o5 o4)
   deleted: (at r o5) (at e o5) (empty o4)
   added: (at r o4) (at e o4) (empty o5)
   goals met: 7 of 11
122. (move o4 o5)
   deleted: (at r o4)
   added: (at r o5)
   goals met: 6 of 11
123. (move o5 o8)
   deleted: (at r o5)
   added: (at r o8)
   goals met: 6 of 11
124. (push g o8 o5)
   deleted: (at r o8) (at g o8) (empty o5)
   added: (at r o5) (at g o5) (empty o8)
   goals met: 6 of 11
125. (move o5 o6)
   deleted: (at r o5)
   added: (at r o6)
   goals met: 6 of 11
126. (move o6 o9)
   deleted: (at r o6)
   added: (at r o9)
   goals met: 6 of 11
127. (push c o9 o8)
   deleted: (at r o9) (at c o9) (empty o8)
   added: (at r o8) (at c o8) (empty o9)
   goals met: 7 of 11
128. (move o8 o5)
   deleted: (at r o8)
   added: (at r o5)
   goals met: 7 of 11
129. (move o5 o6)
   deleted: (at r o5)
   added: (at r o6)
   goals met: 7 of 11
130. (push d o6 o9)
   deleted: (at r o6) (at d o6) (empty o9)
   added: (at r o9) (at d o9) (empty o6)
   goals met: 8 of 11
131. (move o9 o8)
   deleted: (at r o9)
   added: (at r o8)
   goals met: 8 of 11
132. (move o8 o5)
   deleted: (at r o8)
   added: (at r o5)
   goals met: 8 of 11
133. (push g o5 o6)
   deleted: (at r o5) (at g o5) (empty o6)
   added: (at r o6) (at g o6) (empty o5)
   goals met: 9 of 11
134. (move o6 o5)
   deleted: (at r o6)
   added: (at r o5)
   goals met: 9 of 11
135. (move o5 o4)
   deleted: (at r o5)
   added: (at r o4)
   goals met: 10 of 11
136. (push e o4 o5)
   deleted: (at r o4) (at e o4) (empty o5)
   added: (at r o5) (at e o5) (empty o4)
   goals met: 10 of 11
137. (move o5 o4)
   deleted: (at r o5)
   added: (at r o4)
   goals met: 11 of 11
